# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementSet..::..Insert Method
ElementSet Class See Also
---
Insert the specified element into the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	Element item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As Element _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	Element^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ElementThe element to be inserted into the set.
# ### Return Value
Returns whether the element was inserted into the set.
# See Also
ElementSet Class
Autodesk.Revit.DB Namespace